Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/third_level_education/applying_to_college/third_level_education_for_students_with_disabilities.html.txt.tmx
Source language: en
Languages: ga

source: DARE admissions scheme for students with disabilities
ga: Scéim iontrála DARE do mhic léinn míchumasacha

source: • Application procedures for students with a disability
ga: • Gnáthaimh iarratais do mhic léinn faoi mhíchumas

source: There are several support systems for students with disabilities who are undertaking courses at third level
ga: Tá roinnt córas tacaíochta ar fáil do mhic léinn míchumasacha atá ag freastal ar chúrsaí tríú leibhéal

source: Many third-level colleges have a disability or access service which is responsible for giving support and advice to students with disabilities - see 'How to apply' below
ga: Soláthraíonn mórán coláistí tríú leibhéal seirbhísí míchumais nó rochtana atá freagrach as tacaíocht agus comhairle do mhic léinn míchumasacha a thabhairt – féach ‘Conas iarratas a dhéanamh’ thíos

source: The Association for Higher Education Access and Disability (AHEAD) is a voluntary organisation that promotes the participation of students with disabilities in third-level education
ga: Is eagraíocht dheonach í AHEAD a spreagann daltaí míchumasacha chun páirt a ghlacadh in oideachas tríú leibhéal

source: The AHEAD website has a range of information about educational supports for students with disabilities at third level. There is also information about accessing college
ga: Tá réimse eolais ar an suíomh gréasáin AHEAD maidir le tacaíocht oideachais atá ar fáil do mhic léinn míchumasach agus iad ag freastal ar oideachas tríú leibhéal

source: The AHEAD website also has a list of other student services
ga: Tugann sé eolas maidir leis an seirbhísí mic léin

source: Telling the college about your disability
ga: Ag insint don choláiste faoi do mhíchumas

source: If you have a disability, a specific learning difficulty or a significant ongoing illness, you can let the third-level institution know about it - either during the application process or at any time during your course - so that they can consider, in consultation with yourself, any specific support needs you may have in college
ga: Má tá tú faoi mhíchumas, má tá deacracht fhoghlama sonrach agat nó má tinneas suntasach leanúnach ort, is féidir leat an institiúid tríú leibhéal a chur ar an eolas faoi - i rith an phróisis iarratais nó ag aon tráth le linn do chúrsa - ionas gur féidir leo, i gcomhairle leat féin, aon tacaíocht faoi leith gur féidir a bheith agat sa choláiste a mheas

source: If you choose to give this information during the application process (though you are not obliged to do this) you should tick the relevant box on your application form to the Central Applications Office (CAO)
ga: Má roghnaíonn tú an fhaisnéis seo a thabhairt le linn an phróiseas iarratais (cé nach bhfuil dualgas ort é sin a dhéanamh) ba chóir duit tic a chur sa bhosca cuí ar d'fhoirm iarratais chuig an Lár-Oifig Iontrála (LOI)

source: Giving this information on the form will not adversely affect your application in any way
ga: Ní dhéanfaidh an fhaisnéis seo a thabhairt ar an bhfoirm dochair do d'iarratas ar bhealach ar bith

source: In fact, it is by ticking this box that you get the option of the Disability Access Route to Education - see below
ga: Go deimhin, is trí tic a chur sa bhosca seo a fhaigheann tú an rogha an Bhealach Rochtana Míchumais ar Oideachas - féach thíos

source: Application procedures for students with a disability
ga: Gnáthaimh iarratais do mhic léinn faoi mhíchumas

source: The Disability Access Route to Education (DARE) aims to improve access to college for school-leavers with a disability or specific learning difficulty by allocating a number of third-level places to them on a reduced points basis
ga: Is scéim iontrála do mhic léinn faoi mhíchumas é an Bealach Rochtana ar Oideachas do Dhaoine faoi Mhíchumas (DARE). Díríonn an scéim ar rochtain ar an gcoláiste a fheabhsú do lucht fágála scoile a bhfuil míchumas orthu

source: To be eligible for the scheme you must provide evidence that your disability has affected your educational performance significantly – see ‘Supplementary Information Form’ below
ga: Le bheith incháilithe don scéim ní mór duit fianaise a sholáthar go raibh tionchar suntasach ag do mhíchumas ar d’fheidhmíocht oideachais – féach ‘an Fhoirm um Eolas Forlíontach’ thíos

source: You must also be aged under 23 on 1 January 2017
ga: Ní mór duit a bheith faoi bhun 23 bliana d'aois ar 1 Eanáir 2017 freisin

source: How the scheme works
ga: Mar a oibríonn an scéim

source: Each of the third-level colleges participating in the scheme has reserved a number of course places for school-leavers who are eligible for DARE
ga: Tá roinnt áiteanna coinnithe ag gach coláiste tríú leibhéal atá rannpháirteach sa scéim do lucht fágála scoile atá incháilithe do DARE

source: You can find details of the places available through DARE on the websites of the participating third-level colleges
ga: Féadfaidh tú sonraí a fháil faoi áiteanna atá ar fáil trí DARE ar láithreáin ghréasáin na gcoláistí tríú leibhéal atá rannpháirteach

source: You apply for DARE through the Central Applications Office (CAO) – see ‘How to apply’ below
ga: Déantar iarratas ar DARE tríd an Lár-Ionad Iontrála (CAO) – féach 'Conas iarratas a dhéanamh’ thíos

source: Once you have been accepted as eligible for DARE, you then compete for the reduced point places based on your Leaving Certificate results
ga: Nuair a ghlactar leis go bhfuil tú incháilithe do DARE, bíonn comórtas ann don líon áiteanna ar phointí laghdaithe bunaithe ar thorthaí na hArdteistiméireachta

source: A reduced point place means that you may get a place on a third-level course with fewer than the full CAO points
ga: Ciallaíonn áit le ‘pointí laghdaithe’ go bhféadfá áit a fháil ar chúrsa tríú leibhéal gan na pointí iomlána don CAO a bhaint amach

source: For example, if you are eligible for DARE and you get 350 Leaving Certificate points, you may be offered a place on a course that requires 360 points through the standard CAO procedure
ga: Mar shampla, má tá tú incháilithe do DARE agus má bhaineann tú 350 pointe amach san Ardteistiméireacht, d’fhéadfaí áit ar chúrsa 360 pointe a thairiscint duit tríd an CAO

source: However, you must meet the college matriculation requirements and any specific course entry requirements
ga: Mar sin féin, caithfear máithreánach an choláiste agus riachtanais iontrála ar leith an chúrsa a chomhlíonadh

source: Whether you apply for college through DARE or through the standard CAO procedure, there is a range of supports for student with disabilities while they are at college
ga: Cibé an gcuireann tú iarratas isteach ar choláiste trí DARE nó trí ghnáthnós imeachta an CAO, tá raon tacaíochtaí do mhic léinn a bhfuil míchumais orthu, fad is atá siad sa choláiste

source: The supports available vary from college to college but may include: an orientation programme; study skills and extra tuition if required; access to assistive technology and training; mentoring
ga: Bíonn tacaíochtaí éagsúla ar fáil ó choláiste go coláiste ach ina measc bíonn: clár ionduchtaithe; scileanna staidéir agus teagasc breise más gá; rochtain ar theicneolaíocht oiriúnaitheach agus oiliúint; meantóireacht

source: To be eligible for DARE you must provide additional information on the Supplementary Information Form (SIF)
ga: Le bheith incháilithe le haghaidh BRODM ní mór duit eolas breise a sholáthar ar an bhFoirm um Eolas Forlíontach

source: If you tick the box on the online CAO form that asks if you have a disability or specific learning difficulty, you will be directed to the online Supplementary Information Form
ga: Má chuireann tú tic sa bhosca ar an bhfoirm LOI ar líne a iarrann ort má tá tú faoi mhíchumas nó má tá deacracht foghlama sonrach agat, beidh tú stiúraithe chuig an bhFoirm Forlíontach Faisnéise ar líne

source: If you are making a paper application, you can request a paper version of the Supplementary Information Form
ga: Má tá tú ag déanamh iarratas ar pháipéar, is féidir leat iarradh ar leagan páipéir den Fhoirm um Fhaisnéis Forlíontach

source: The form has 3 sections as follows:
ga: Tá trí alt ann mar seo a leanas:

source: • Section A asks for information on your disability and if you wish to be considered for DARE
ga: • Iarrann AltA le haghaidh eolas mar gheall ar do mhíchumas. Iarrann sé má tá tú ag iarraidh a bheith meastaithe le haghaidh BRODM

source: • Section B is a Educational Impact Statement, to be completed by your school
ga: • Is Ráiteas Tionchair Oideachais (pdf) é Alt B atá le bheith comhlánaithe ag do scoil

source: It provides information about your educational experience and assists the decision about the third-level supports you need
ga: Tugann sé eolas faoi do thaithí oideachais agus cabhraíonn sé cinneadh a dhéanamh maidir leis na tacaíochtaí tríú-leibhéal a theastaíonn uait

source: • Section C is Evidence of Disability which must be completed by the accepted medical consultant or specialist for your particular disability
ga: • Is foirm um eolas ar mhíchumas (pdf) é Alt C atá le bheith comhlánaithe ag saineolaí nó comhairleoir míochaine inghlactha do do mhíchumas ar leith

source: It provides verification of your disability and helps the decision about the third-level supports that you need
ga: Tugann sé seo fíorú ar do mhíchumas agus cabhraíonn sé cinneadh a dhéanamh maidir leis na tacaíochtaí tríú leibhéal a theastaíonn uait

source: Supports for students with disabilities
ga: Tacaíocht do mhic léinn faoi mhíchumas

source: If you have indicated on your CAO form that you have a disability or specific learning difficulty, the college's Disability Service will be informed as soon as you accept a place, and they will get in touch with you to work out what supports they can provide
ga: Má chuir tú in iúl ar d’fhoirm LOI go bhfuil tú faoi mhíchumas nó go bhfuil deacracht foghlama ar leith, cuirfear Seirbhís Mhíchumas an choláiste ar an eolas chomh luath agus a ghlacann tú le háit, agus beidh siad i dteagmháil leat chun na tacaíochtaí gur féidir leo a chur ar fáil a oibriú amach

source: Even if you didn't tick this box on the CAO form, you can still access the available supports by contacting the college's Disability Service at any stage during your time in college
ga: Fiú más rud é nár chuir tú tic sa bhosca seo ar an bhfoirm LOI, is féidir leat rochtain a fháil ar na tacaíochtaí atá ar fáil trí theagmháil a dhéanamh le Seirbhís Mhíchumas an choláiste ag tráth ar bith le linn do chuid ama sa choláiste

source: If you wish to apply for a college place under the DARE scheme you should apply through the Central Applications Office (CAO)
ga: Más mian leat iarratas a dhéanamh ar áit choláiste faoin scéim BRODM ba chóir duit iarratas a dhéanamh tríd an Lár-Oifig Iontrála (LOI)

source: When you are filling in the CAO form online you must complete the part of the form to say that you have a disability or specific learning difficulty
ga: Nuair atá tú ag líonadh isteach an fhoirm LOI ar líne ní mór duit an chuid den fhoirm a líonadh chun a rá go bhfuil tú faoi mhíchumas nó go bhfuil deacracht shonrach foghlama agat

source: You will then be directed to the separate online Supplementary Information Form
ga: Beidh tú atreoraithe ansin chuig Foirm Forlíontach Faisnéise eile ar líne

source: If you prefer, you can contact the CAO and ask for paper versions of the main form and the Supplementary Information Form
ga: Más mian leat, is féidir leat teagmháil a dhéanamh leis an LOI agus iarradh orthu leaganacha páipéir den phríomhfhoirm agus den Fhoirm Fhaisnéise Forlíontach a fháil

source: Sections B and C can only be sent to the CAO in paper form
ga: Ní féidir le Ranna B agus C a bheith seolta chuig an LOI i bhfoirm pháipéar amháin

source: The CAO advises all students to get a certificate of posting when sending documents by post
ga: Molann an LOI do gach mac léinn teastas postála a fháil agus cáipéis á sheoladh tríd an bpost

source: Key dates for 2017 applications using DARE
ga: Príomhdátaí iarratais le haghaidh 2017 ag baint úsáide as BRODM

source: 4 November 2016 - the online CAO application facility for 2017 opens
ga: 4 Samhain 2016 - osclaíonn an CAO áis iarratas ar líne le haghaidh 2015 ag meán lae

source: 1 February 2017 - your main application (online or paper) must reach the CAO by 5.15 p.m
ga: 1 Feabhra 2017 - ní mór do phríomhiarratas (ar líne nó ar pháipéar) a bheith ag an LOI ag 5:15 i.n

source: 1 March 2017 - the following 3 items must reach the CAO by 5.15 p.m
ga: 1 Márta 2017 - ní mór na trí mhír seo a leanas a bheith ag an LOI roimh 5.15i.n

source: • Tick the box on the main CAO form that indicates you have a disability or specific learning difficulty
ga: • Cuir tic sa bhosca ar an bpríomhfhoirm LOI a chuireann in iúl go bhfuil tú faoi mhíchumas nó go bhfuil deacracht foghlama sonrach agat

source: • Complete Section A of the Supplementary Information Form
ga: • Comhlánaigh Cuid A den Fhoirm Eolais Forlíontach

source: • Indicate that you wish to be considered for DARE by ticking 'Yes' on question 1
ga: • Cuir in iúl gur mian leat a bheith curtha san áireamh do BRODM trí tic a chur sa bhosca 'Sea ', ar cheist 1

source: 1 April 2017, the rest of the Supplementary Information Form must reach the CAO by 5.15 p.m
ga: 1 Aibreán 2017 - ní mór an chuid eile den Fhoirm Eolais Forlíontach a bheith ag an LOI ag 5:15 i.n

source: • Section B (the Educational Impact Statement)
ga: • Cuid B (Ráiteas Tionchair Oideachais)

source: No applications will be accepted after these closing dates
ga: Ní ghlacfar le haon iarratais tar éis na dátaí deireanacha seo

source: The closing dates are very strict because DARE is an additional application procedure which needs extra processing time
ga: Tá na dátaí deireanacha an-dian de bhrí go bhfuil BRODM ina nós imeachta iarratais breise atá am próiseála breise ag teastáil uaidh

source: You be notified by post by the end of June 2017 (after the Leaving Certificate exam) telling you whether you are eligible for the DARE scheme
ga: Gheobhaidh tú litir i mí an Mheithimh déanaigh 2017 (tar éis scrúdú na hArdteistiméireachta) ag insint duit cibé an bhfuil tú incháilithe don scéim BRODM

source: If you are told you are not eligible you can ask for your application to be reviewed
ga: Má dheirtear leat nach bhfuil tú incháilithe is féidir leat iarradh ar athbhreithniú

source: If you are not eligible for DARE you can still get into college if you meet the entry requirements for your chosen course
ga: Mura bhfuil tú incháilithe le haghaidh BRODM is féidir leat freastal ar an gcoláiste má chomhlíonann tú na riachtanais iontrála le haghaidh do rogha cúrsa

source: The CAO helpline at (091) 509 800 can help you with your DARE application
ga: Is féidir le líne chabhrach LOI ag (091) 509800 cabhrú leat le d'iarratas BRODM

source: You can find further information in this list of frequently asked questions on the Access College website
ga: Is féidir leat tuilleadh eolais a fháil sa liosta ceisteanna seo a chuirtear go minic seo ar láithreán gréasáin an Choláiste Rochtana

source: You can also contact the access services of the colleges participating in the DARE scheme
ga: Is féidir leat teagmháil a dhéanamh freisin le seirbhísí rochtana na gcoláistí atá rannpháirteach sa scéim BRODM

source: The DARE programme runs nationwide information sessions for students and their parents/guardians to deal with queries about preparing the application
ga: Eagraíonn an clár náisiúnta BRODM seisiúin eolais do mhic léinn agus dá dtuismitheoirí/gcaomhnóirí chun déileáil le ceisteanna maidir leis an iarratas a ullmhú

source: You can download a detailed Application Guide (pdf) and checklist (pdf) to help with your application
ga: Is féidir leat Treoir Iarratais mhionsonraithe (pdf) agus seicliosta (pdf) a íoslódáil chun cabhrú le d'iarratas

source: You can also access information about DARE on Facebook
ga: Is féidir leat teacht ar eolas freisin faoi BRODM ar Facebook
